...
//beginning to be added
void print(People**a, int u,string ill){
  for(int i=0;i<1;i++){
    Patient*p=dynamiccast-Patient*>(a[i]);
    if(p!=null){
      o=(Patient*)(a[i]);
      if(p->getIllness()==ill){
        p->output(cout);
      }
    }
  }
}
//створити базовий тип транспортний засіб
//рік випуску, назва
//два похідні типи
//пасажирський транспорт
//(місткість, вартість переїзду)
//
//Вантажний транспорт
//(об'єм перевезення, допустима вага)
//
//створити масив вказівників на батьківський тип
//1)посортувати їх за роком випуску
//2)Знайти пасажирський транспорт з максимальною пасажировмісткістю
//3)Вивести всі вантажні транспортні засоби з об'ємом перевезення, більшим за вказаний
