//розробити тип для обліку проданих авіаквитків
//назва авіакомпанії
//назва маршруту(пара міст)
//вартість квитка
//Утворити перелік квитків з різними даними
//вивести в стандартний потік утворений масив
//вивести назву маршруту з найдешевшим квитком
//-----------------------------
//тип продані авіаквитки для пасажирів з багажем,
//які крім характеристик квитка мають ще МАСУ БАГАЖУ
//тоді ціна буде price*( 1 + coefficent*mass)
//ввести дані з файлу в масив
//визначити назви компаній і маршрути з найдешевшим квитком
//вивести перелік усіх маршрутів
//------------------------------------------
//розробити тип для обліку проданих квитків бізнес-класу
//вартість = вартість з багажем * coefficient
// ввести у спільний масив дані квитків з трьох файлів
//знайти компанії та маршрути з найдешевшим квитком
//вивести перелік усіх маршрутів цих компаній
